/*****************************************************************//**
 * \file   ColorTarget.h
 * \brief  カラーターゲットクラス
 * 
 * \author Hiroto Kuge
 * \date   October 2022
 *********************************************************************/
#pragma once

 //-----------------------------------------------------------------------------
 // Includes.
 //-----------------------------------------------------------------------------
#include <d3d12.h>
#include <dxgi1_6.h>
#include <cstdint>
#include "ComPtr.h"


//-----------------------------------------------------------------------------
// Forword Declatations.
//-----------------------------------------------------------------------------
class DescriptorHandle;
class DescriptorPool;

/*****************************************************************//**
 * ColorTarget Class.
 *********************************************************************/
class ColorTarget{
	//-----------------------------------------------------------------------------
	//	list of friend classes and methods.
	//-----------------------------------------------------------------------------
	//!{
			/* Nothing */
	//!}
public:
	//-----------------------------------------------------------------------------
	//	public variables.
	//-----------------------------------------------------------------------------	
	//!{
			/* Nothing */
	//!} 
	//-----------------------------------------------------------------------------
	//	public methods.
	//-----------------------------------------------------------------------------	
	//!{
	
	/*****************************************************************//**
	 * \brief コンストラクタ
	 *********************************************************************/
	ColorTarget();
	
	/*****************************************************************//**
	 * \brief デストラクタ
	 *********************************************************************/
	~ColorTarget();
	
	/*****************************************************************//**
	 * \brief 初期化処理
	 * 
	 * \param pDevice	デバイス
	 * \param pPoolRTV	ディスクリプタプール
	 * \param width		横幅
	 * \param height	縦幅
	 * \param format	ピクセルフォーマット
	 * \return true		初期化成功
	 * \return false	初期化失敗
	 *********************************************************************/
	bool Init(
		ID3D12Device* pDevice,
		DescriptorPool* pPoolRTV,
		uint32_t        width,
		uint32_t        height,
		DXGI_FORMAT     format);

	/*****************************************************************//**
	 * \brief バックバッファから初期化処理を行う
	 * \param pDevice		デバイス
	 * \param pPoolRTV		ディスクリプタプール
	 * \param index			バックバッファ番号
	 * \param pSwapChain	スワップチェイン
	 * \return	true		初期化成功
	 * \return	false		初期化失敗
	 *********************************************************************/
	bool InitFromBackBuffer(
		ID3D12Device* pDevice,
		DescriptorPool* pPoolRTV,
		uint32_t        index,
		IDXGISwapChain* pSwapChain);

	/*****************************************************************//**
	 * \brief 終了処理
	 *********************************************************************/
	void Term();

	/*****************************************************************//**
	 * \brief	ディスクリプタハンドル(RTV用)を取得する
	 * \return	ディスクリプタハンドル(RTV用) 
	 *********************************************************************/
	DescriptorHandle* GetHandleRTV()const;

	/*****************************************************************//**
	 * \brief	リソースを取得
	 * \return	リソース
	 *********************************************************************/
	ID3D12Resource* GetResource()const;

	/*****************************************************************//**
	 * \brief	リソースの設定を取得
	 * \return	リソースの設定
	 *********************************************************************/
	D3D12_RESOURCE_DESC GetDesc() const;

	/*****************************************************************//**
	 * \brief	レンダーターゲットビューの設定を取得
	 * \return	レンダーターゲットビューの設定
	 *********************************************************************/
	D3D12_RENDER_TARGET_VIEW_DESC GetViewDesc() const;

	//!}
private:

	//-----------------------------------------------------------------------------
	// private variables.
	//-----------------------------------------------------------------------------
	//!{
	
	ComPtr<ID3D12Resource>          m_pTarget;		// リソース
	DescriptorHandle*				m_pHandleRTV;	// ディスクリプタハンドル(RTV用)
	DescriptorPool*					m_pPoolRTV;		// ディスクリプタプール(RTV用)
	D3D12_RENDER_TARGET_VIEW_DESC   m_ViewDesc;		// レンダーターゲットビューの構成

	//!} 
	//-----------------------------------------------------------------------------
	// private methods.
	//-----------------------------------------------------------------------------
	//!{

	ColorTarget(const ColorTarget&) = delete;
	void operator = (const ColorTarget&) = delete;

	//!} 
};

