#pragma once
#include<DirectXMath.h>

constexpr float PI = 3.1415926535;//円周率


/*****************************************************************//**
 * \brief ラジアンに変換
 * \param radius 度数法の角
 * \return 変換した角
 *********************************************************************/
inline float ToRad(float radius) {
	float rad = radius * PI / 180;

	return rad;
}


/*****************************************************************//**
 * クオータニオンクラス
 *********************************************************************/
class Quaternion {
public:

private:
};


